---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentWeight
source: html/c885b9ed-65c4-a8dd-8f75-e26ec161c006.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentWeight Property

"End Segment Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId GridEndSegmentWeight { get; }
```